
імя = input("Введіть своє ім'я та побатькові: ")


while True:
    вік = input("Введіть свій вік: ")
    if вік.isdigit():
        break
    else:
        print("Будь ласка, введіть вік у вигляді числа.")


while True:
    номер_телефону = input("Введіть свій номер телефону: ")
    if номер_телефону.isdigit():
        break
    else:
        print("Будь ласка, введіть номер телефону у вигляді числа без пробілів та інших символів.")


print("Ваше ім'я:", імя)
print("Ваш вік:", вік)
print("Ваш номер телефону:", номер_телефону)